{
  "format": "graph-model",
  "generatedBy": "https://github.com/google/mediapipe",
  "convertedBy": "https://github.com/vladmandic",
  "signature":
  {
      "inputs":
      {
          "input:0": {"name":"input:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"128"},{"size":"128"},{"size":"3"}]}}
      },
      "outputs":
      {
          "classificators:0": {"name":"classificators:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"896"},{"size":"1"}]}},
          "regressors:0": {"name":"regressors:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"896"},{"size":"12"}]}}
      }
  },
  "modelTopology":
  {
      "node":
      [
          {"name":"Conv2D_31/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"2"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"classificator_8/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"reshape/shape","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"Conv2D_32/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"256"},{"size":"6"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"classificator_16/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"6"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"reshape_2/shape","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"classificators/axis","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"Conv2D_33/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"24"}]}}}}},
          {"name":"regressor_8/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"reshape_1/shape","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"channel_padding_3/paddings","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"channel_padding_2/paddings","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"channel_padding_1/paddings","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"channel_padding/paddings","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"input","op":"Placeholder","attr":{"dtype":{"type":"DT_FLOAT"},"shape":{"shape":{"dim":[{"size":"1"},{"size":"128"},{"size":"128"},{"size":"3"}]}}}},
          {"name":"Conv2D/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"3"},{"size":"48"}]}}}}},
          {"name":"conv2d_1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"48"}]}}}}},
          {"name":"depthwise/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"48"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_2/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"48"},{"size":"48"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_1_1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"48"}]}}}}},
          {"name":"depthwise_1/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"48"},{"size":"1"}]}}}}},
          {"name":"Conv2D_3/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"48"},{"size":"48"}]}}}}},
          {"name":"conv2d_2_1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"48"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_2/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"48"},{"size":"1"}]}}}}},
          {"name":"Conv2D_4/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"48"},{"size":"48"}]}}}}},
          {"name":"conv2d_3_1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"48"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_3/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"48"},{"size":"1"}]}}}}},
          {"name":"Conv2D_5/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"48"},{"size":"64"}]}}}}},
          {"name":"conv2d_4_1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}}}},
          {"name":"depthwise_4/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"64"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_6/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"64"},{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_5_1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_5/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"64"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_7/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"64"},{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_6_1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_6/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"64"},{"size":"1"}]}}}}},
          {"name":"Conv2D_8/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"64"},{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_7_1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_7/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"64"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_9/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"64"},{"size":"96"}]}}}}},
          {"name":"conv2d_8_1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}}}},
          {"name":"depthwise_8/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"96"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_10/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"96"},{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_9_1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_9/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"96"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_11/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"96"},{"size":"96"}]}}}}},
          {"name":"conv2d_10_1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}}}},
          {"name":"depthwise_10/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"96"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_12/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"96"},{"size":"96"}]}}}}},
          {"name":"conv2d_11_1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}}}},
          {"name":"depthwise_11/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"96"},{"size":"1"}]}}}}},
          {"name":"Conv2D_13/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"96"},{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_12_1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}}}},
          {"name":"depthwise_12/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"96"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_14/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"96"},{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_13_1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}}}},
          {"name":"depthwise_13/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"96"},{"size":"1"}]}}}}},
          {"name":"Conv2D_15/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"96"},{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_14_1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}}}},
          {"name":"depthwise_14/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"96"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_16/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"96"},{"size":"128"}]}}}}},
          {"name":"conv2d_15_1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_15/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"128"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_17/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_16_1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}}}},
          {"name":"depthwise_16/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"128"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_18/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_17_1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_17/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"128"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_19/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_18_1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}}}},
          {"name":"depthwise_18/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"128"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_20/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_19_1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}}}},
          {"name":"depthwise_19/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"128"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_21/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_20_1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_20/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"128"},{"size":"1"}]}}}}},
          {"name":"Conv2D_22/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_21_1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_21/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"128"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_23/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"128"}]}}}}},
          {"name":"conv2d_22_1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_22/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"128"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_24/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_23_1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}}}},
          {"name":"depthwise_23/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"256"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_25/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"256"},{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_24_1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}}}},
          {"name":"depthwise_24/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"256"},{"size":"1"}]}}}}},
          {"name":"Conv2D_26/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"256"},{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_25_1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_25/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"256"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_27/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"256"},{"size":"256"}]}}}}},
          {"name":"conv2d_26_1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_26/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"256"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_28/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"256"},{"size":"256"}]}}}}},
          {"name":"conv2d_27_1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}}}},
          {"name":"depthwise_27/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"256"},{"size":"1"}]}}}}},
          {"name":"Conv2D_29/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"256"},{"size":"256"}]}}}}},
          {"name":"conv2d_28_1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}}}},
          {"name":"depthwise_28/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"256"},{"size":"1"}]}}}}},
          {"name":"Conv2D_30/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"256"},{"size":"256"}]}}}}},
          {"name":"conv2d_29_1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_34/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"256"},{"size":"72"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"regressor_16/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"72"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"reshape_3/shape","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"regressors/axis","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"Conv2D","op":"Conv2D","input":["input","Conv2D/filter"],"device":"/device:CPU:0","attr":{"explicit_paddings":{"list":{}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="}}},
          {"name":"conv2d_1","op":"Add","input":["Conv2D","conv2d_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"activation","op":"Relu","input":["conv2d_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"depthwise","op":"DepthwiseConv2dNative","input":["activation","depthwise/filter_in"],"attr":{"T":{"type":"DT_FLOAT"},"dilations":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"Conv2D_2","op":"Conv2D","input":["depthwise","Conv2D_2/filter"],"device":"/device:CPU:0","attr":{"padding":{"s":"VkFMSUQ="},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_1_1","op":"Add","input":["Conv2D_2","conv2d_1_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"add__xeno_compat__1","op":"Add","input":["activation","conv2d_1_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"activation_1","op":"Relu","input":["add__xeno_compat__1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_1","op":"DepthwiseConv2dNative","input":["activation_1","depthwise_1/filter_in"],"attr":{"explicit_paddings":{"list":{}},"data_format":{"s":"TkhXQw=="},"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_3","op":"Conv2D","input":["depthwise_1","Conv2D_3/filter"],"device":"/device:CPU:0","attr":{"explicit_paddings":{"list":{}},"data_format":{"s":"TkhXQw=="},"padding":{"s":"VkFMSUQ="},"strides":{"list":{"i":["1","1","1","1"]}},"dilations":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"T":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_2_1","op":"Add","input":["Conv2D_3","conv2d_2_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"add_1__xeno_compat__1","op":"Add","input":["activation_1","conv2d_2_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"activation_2","op":"Relu","input":["add_1__xeno_compat__1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_2","op":"DepthwiseConv2dNative","input":["activation_2","depthwise_2/filter_in"],"attr":{"strides":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"},"dilations":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}}}},
          {"name":"Conv2D_4","op":"Conv2D","input":["depthwise_2","Conv2D_4/filter"],"device":"/device:CPU:0","attr":{"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"padding":{"s":"VkFMSUQ="},"use_cudnn_on_gpu":{"b":true}}},
          {"name":"conv2d_3_1","op":"Add","input":["Conv2D_4","conv2d_3_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"add_2__xeno_compat__1","op":"Add","input":["activation_2","conv2d_3_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"activation_3","op":"Relu","input":["add_2__xeno_compat__1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"max_pooling2d","op":"MaxPool","input":["activation_3"],"attr":{"ksize":{"list":{"i":["1","2","2","1"]}},"padding":{"s":"U0FNRQ=="},"strides":{"list":{"i":["1","2","2","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}}}},
          {"name":"depthwise_3","op":"DepthwiseConv2dNative","input":["activation_3","depthwise_3/filter_in"],"attr":{"strides":{"list":{"i":["1","2","2","1"]}},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},
          {"name":"channel_padding","op":"Pad","input":["max_pooling2d","channel_padding/paddings"],"attr":{"T":{"type":"DT_FLOAT"},"Tpaddings":{"type":"DT_INT32"}}},
          {"name":"Conv2D_5","op":"Conv2D","input":["depthwise_3","Conv2D_5/filter"],"device":"/device:CPU:0","attr":{"T":{"type":"DT_FLOAT"},"padding":{"s":"VkFMSUQ="},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true}}},
          {"name":"conv2d_4_1","op":"Add","input":["Conv2D_5","conv2d_4_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"add_3__xeno_compat__1","op":"Add","input":["channel_padding","conv2d_4_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"activation_4","op":"Relu","input":["add_3__xeno_compat__1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_4","op":"DepthwiseConv2dNative","input":["activation_4","depthwise_4/filter_in"],"attr":{"strides":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="}}},
          {"name":"Conv2D_6","op":"Conv2D","input":["depthwise_4","Conv2D_6/filter"],"device":"/device:CPU:0","attr":{"explicit_paddings":{"list":{}},"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"},"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"VkFMSUQ="},"use_cudnn_on_gpu":{"b":true},"strides":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"conv2d_5_1","op":"Add","input":["Conv2D_6","conv2d_5_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"add_4__xeno_compat__1","op":"Add","input":["activation_4","conv2d_5_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"activation_5","op":"Relu","input":["add_4__xeno_compat__1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_5","op":"DepthwiseConv2dNative","input":["activation_5","depthwise_5/filter_in"],"attr":{"strides":{"list":{"i":["1","1","1","1"]}},"dilations":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"},"padding":{"s":"U0FNRQ=="}}},
          {"name":"Conv2D_7","op":"Conv2D","input":["depthwise_5","Conv2D_7/filter"],"device":"/device:CPU:0","attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"strides":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"VkFMSUQ="},"explicit_paddings":{"list":{}},"T":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_6_1","op":"Add","input":["Conv2D_7","conv2d_6_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"add_5__xeno_compat__1","op":"Add","input":["activation_5","conv2d_6_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"activation_6","op":"Relu","input":["add_5__xeno_compat__1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_6","op":"DepthwiseConv2dNative","input":["activation_6","depthwise_6/filter_in"],"attr":{"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"Conv2D_8","op":"Conv2D","input":["depthwise_6","Conv2D_8/filter"],"device":"/device:CPU:0","attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"},"use_cudnn_on_gpu":{"b":true},"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"VkFMSUQ="},"explicit_paddings":{"list":{}},"strides":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"conv2d_7_1","op":"Add","input":["Conv2D_8","conv2d_7_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"add_6__xeno_compat__1","op":"Add","input":["activation_6","conv2d_7_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"activation_7","op":"Relu","input":["add_6__xeno_compat__1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"max_pooling2d_1","op":"MaxPool","input":["activation_7"],"attr":{"T":{"type":"DT_FLOAT"},"explicit_paddings":{"list":{}},"ksize":{"list":{"i":["1","2","2","1"]}},"strides":{"list":{"i":["1","2","2","1"]}},"padding":{"s":"U0FNRQ=="},"data_format":{"s":"TkhXQw=="}}},
          {"name":"depthwise_7","op":"DepthwiseConv2dNative","input":["activation_7","depthwise_7/filter_in"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","2","2","1"]}},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="}}},
          {"name":"channel_padding_1","op":"Pad","input":["max_pooling2d_1","channel_padding_1/paddings"],"attr":{"Tpaddings":{"type":"DT_INT32"},"T":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_9","op":"Conv2D","input":["depthwise_7","Conv2D_9/filter"],"device":"/device:CPU:0","attr":{"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"VkFMSUQ="},"T":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_8_1","op":"Add","input":["Conv2D_9","conv2d_8_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"add_7__xeno_compat__1","op":"Add","input":["channel_padding_1","conv2d_8_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"activation_8","op":"Relu","input":["add_7__xeno_compat__1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_8","op":"DepthwiseConv2dNative","input":["activation_8","depthwise_8/filter_in"],"attr":{"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="}}},
          {"name":"Conv2D_10","op":"Conv2D","input":["depthwise_8","Conv2D_10/filter"],"device":"/device:CPU:0","attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"VkFMSUQ="},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"conv2d_9_1","op":"Add","input":["Conv2D_10","conv2d_9_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"add_8__xeno_compat__1","op":"Add","input":["activation_8","conv2d_9_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"activation_9","op":"Relu","input":["add_8__xeno_compat__1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_9","op":"DepthwiseConv2dNative","input":["activation_9","depthwise_9/filter_in"],"attr":{"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="}}},
          {"name":"Conv2D_11","op":"Conv2D","input":["depthwise_9","Conv2D_11/filter"],"device":"/device:CPU:0","attr":{"use_cudnn_on_gpu":{"b":true},"padding":{"s":"VkFMSUQ="},"strides":{"list":{"i":["1","1","1","1"]}},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"explicit_paddings":{"list":{}},"data_format":{"s":"TkhXQw=="}}},
          {"name":"conv2d_10_1","op":"Add","input":["Conv2D_11","conv2d_10_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"add_9__xeno_compat__1","op":"Add","input":["activation_9","conv2d_10_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"activation_10","op":"Relu","input":["add_9__xeno_compat__1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_10","op":"DepthwiseConv2dNative","input":["activation_10","depthwise_10/filter_in"],"attr":{"strides":{"list":{"i":["1","1","1","1"]}},"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}}}},
          {"name":"Conv2D_12","op":"Conv2D","input":["depthwise_10","Conv2D_12/filter"],"device":"/device:CPU:0","attr":{"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"VkFMSUQ="},"T":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_11_1","op":"Add","input":["Conv2D_12","conv2d_11_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"add_10__xeno_compat__1","op":"Add","input":["activation_10","conv2d_11_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"activation_11","op":"Relu","input":["add_10__xeno_compat__1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_11","op":"DepthwiseConv2dNative","input":["activation_11","depthwise_11/filter_in"],"attr":{"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"dilations":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="}}},
          {"name":"Conv2D_13","op":"Conv2D","input":["depthwise_11","Conv2D_13/filter"],"device":"/device:CPU:0","attr":{"data_format":{"s":"TkhXQw=="},"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"VkFMSUQ="},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"T":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_12_1","op":"Add","input":["Conv2D_13","conv2d_12_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"add_11__xeno_compat__1","op":"Add","input":["activation_11","conv2d_12_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"activation_12","op":"Relu","input":["add_11__xeno_compat__1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_12","op":"DepthwiseConv2dNative","input":["activation_12","depthwise_12/filter_in"],"attr":{"T":{"type":"DT_FLOAT"},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"dilations":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"Conv2D_14","op":"Conv2D","input":["depthwise_12","Conv2D_14/filter"],"device":"/device:CPU:0","attr":{"strides":{"list":{"i":["1","1","1","1"]}},"dilations":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"VkFMSUQ="},"T":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_13_1","op":"Add","input":["Conv2D_14","conv2d_13_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"add_12__xeno_compat__1","op":"Add","input":["activation_12","conv2d_13_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"activation_13","op":"Relu","input":["add_12__xeno_compat__1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_13","op":"DepthwiseConv2dNative","input":["activation_13","depthwise_13/filter_in"],"attr":{"explicit_paddings":{"list":{}},"data_format":{"s":"TkhXQw=="},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"},"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"Conv2D_15","op":"Conv2D","input":["depthwise_13","Conv2D_15/filter"],"device":"/device:CPU:0","attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"padding":{"s":"VkFMSUQ="},"T":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_14_1","op":"Add","input":["Conv2D_15","conv2d_14_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"add_13__xeno_compat__1","op":"Add","input":["activation_13","conv2d_14_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"activation_14","op":"Relu","input":["add_13__xeno_compat__1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"max_pooling2d_2","op":"MaxPool","input":["activation_14"],"attr":{"data_format":{"s":"TkhXQw=="},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","2","2","1"]}},"explicit_paddings":{"list":{}},"ksize":{"list":{"i":["1","2","2","1"]}}}},
          {"name":"depthwise_14","op":"DepthwiseConv2dNative","input":["activation_14","depthwise_14/filter_in"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"explicit_paddings":{"list":{}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","2","2","1"]}},"data_format":{"s":"TkhXQw=="}}},
          {"name":"channel_padding_2","op":"Pad","input":["max_pooling2d_2","channel_padding_2/paddings"],"attr":{"T":{"type":"DT_FLOAT"},"Tpaddings":{"type":"DT_INT32"}}},
          {"name":"Conv2D_16","op":"Conv2D","input":["depthwise_14","Conv2D_16/filter"],"device":"/device:CPU:0","attr":{"padding":{"s":"VkFMSUQ="},"use_cudnn_on_gpu":{"b":true},"dilations":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}}}},
          {"name":"conv2d_15_1","op":"Add","input":["Conv2D_16","conv2d_15_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"add_14__xeno_compat__1","op":"Add","input":["channel_padding_2","conv2d_15_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"activation_15","op":"Relu","input":["add_14__xeno_compat__1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_15","op":"DepthwiseConv2dNative","input":["activation_15","depthwise_15/filter_in"],"attr":{"T":{"type":"DT_FLOAT"},"dilations":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"padding":{"s":"U0FNRQ=="}}},
          {"name":"Conv2D_17","op":"Conv2D","input":["depthwise_15","Conv2D_17/filter"],"device":"/device:CPU:0","attr":{"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"},"padding":{"s":"VkFMSUQ="}}},
          {"name":"conv2d_16_1","op":"Add","input":["Conv2D_17","conv2d_16_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"add_15__xeno_compat__1","op":"Add","input":["activation_15","conv2d_16_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"activation_16","op":"Relu","input":["add_15__xeno_compat__1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_16","op":"DepthwiseConv2dNative","input":["activation_16","depthwise_16/filter_in"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"T":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_18","op":"Conv2D","input":["depthwise_16","Conv2D_18/filter"],"device":"/device:CPU:0","attr":{"data_format":{"s":"TkhXQw=="},"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"T":{"type":"DT_FLOAT"},"padding":{"s":"VkFMSUQ="},"explicit_paddings":{"list":{}}}},
          {"name":"conv2d_17_1","op":"Add","input":["Conv2D_18","conv2d_17_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"add_16__xeno_compat__1","op":"Add","input":["activation_16","conv2d_17_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"activation_17","op":"Relu","input":["add_16__xeno_compat__1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_17","op":"DepthwiseConv2dNative","input":["activation_17","depthwise_17/filter_in"],"attr":{"strides":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"explicit_paddings":{"list":{}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"dilations":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"Conv2D_19","op":"Conv2D","input":["depthwise_17","Conv2D_19/filter"],"device":"/device:CPU:0","attr":{"T":{"type":"DT_FLOAT"},"use_cudnn_on_gpu":{"b":true},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"data_format":{"s":"TkhXQw=="},"padding":{"s":"VkFMSUQ="},"dilations":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"conv2d_18_1","op":"Add","input":["Conv2D_19","conv2d_18_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"add_17__xeno_compat__1","op":"Add","input":["activation_17","conv2d_18_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"activation_18","op":"Relu","input":["add_17__xeno_compat__1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_18","op":"DepthwiseConv2dNative","input":["activation_18","depthwise_18/filter_in"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"},"explicit_paddings":{"list":{}},"strides":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"Conv2D_20","op":"Conv2D","input":["depthwise_18","Conv2D_20/filter"],"device":"/device:CPU:0","attr":{"padding":{"s":"VkFMSUQ="},"explicit_paddings":{"list":{}},"T":{"type":"DT_FLOAT"},"use_cudnn_on_gpu":{"b":true},"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="}}},
          {"name":"conv2d_19_1","op":"Add","input":["Conv2D_20","conv2d_19_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"add_18__xeno_compat__1","op":"Add","input":["activation_18","conv2d_19_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"activation_19","op":"Relu","input":["add_18__xeno_compat__1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_19","op":"DepthwiseConv2dNative","input":["activation_19","depthwise_19/filter_in"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"T":{"type":"DT_FLOAT"},"padding":{"s":"U0FNRQ=="},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"Conv2D_21","op":"Conv2D","input":["depthwise_19","Conv2D_21/filter"],"device":"/device:CPU:0","attr":{"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"VkFMSUQ="},"explicit_paddings":{"list":{}},"strides":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_20_1","op":"Add","input":["Conv2D_21","conv2d_20_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"add_19__xeno_compat__1","op":"Add","input":["activation_19","conv2d_20_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"activation_20","op":"Relu","input":["add_19__xeno_compat__1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_20","op":"DepthwiseConv2dNative","input":["activation_20","depthwise_20/filter_in"],"attr":{"explicit_paddings":{"list":{}},"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"Conv2D_22","op":"Conv2D","input":["depthwise_20","Conv2D_22/filter"],"device":"/device:CPU:0","attr":{"strides":{"list":{"i":["1","1","1","1"]}},"dilations":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"padding":{"s":"VkFMSUQ="},"explicit_paddings":{"list":{}},"T":{"type":"DT_FLOAT"},"use_cudnn_on_gpu":{"b":true}}},
          {"name":"conv2d_21_1","op":"Add","input":["Conv2D_22","conv2d_21_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"add_20__xeno_compat__1","op":"Add","input":["activation_20","conv2d_21_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"activation_21","op":"Relu","input":["add_20__xeno_compat__1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_21","op":"DepthwiseConv2dNative","input":["activation_21","depthwise_21/filter_in"],"attr":{"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="}}},
          {"name":"Conv2D_23","op":"Conv2D","input":["depthwise_21","Conv2D_23/filter"],"device":"/device:CPU:0","attr":{"use_cudnn_on_gpu":{"b":true},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"padding":{"s":"VkFMSUQ="},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"dilations":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"conv2d_22_1","op":"Add","input":["Conv2D_23","conv2d_22_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"add_21__xeno_compat__1","op":"Add","input":["activation_21","conv2d_22_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"activation_22","op":"Relu","input":["add_21__xeno_compat__1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_31","op":"Conv2D","input":["activation_22","Conv2D_31/filter"],"device":"/device:CPU:0","attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"padding":{"s":"U0FNRQ=="}}},
          {"name":"Conv2D_33","op":"Conv2D","input":["activation_22","Conv2D_33/filter"],"device":"/device:CPU:0","attr":{"T":{"type":"DT_FLOAT"},"dilations":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="},"use_cudnn_on_gpu":{"b":true},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"max_pooling2d_3","op":"MaxPool","input":["activation_22"],"attr":{"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","2","2","1"]}},"ksize":{"list":{"i":["1","2","2","1"]}},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"},"explicit_paddings":{"list":{}}}},
          {"name":"depthwise_22","op":"DepthwiseConv2dNative","input":["activation_22","depthwise_22/filter_in"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","2","2","1"]}},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"}}},
          {"name":"classificator_8","op":"Add","input":["Conv2D_31","classificator_8/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"regressor_8","op":"Add","input":["Conv2D_33","regressor_8/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"channel_padding_3","op":"Pad","input":["max_pooling2d_3","channel_padding_3/paddings"],"attr":{"T":{"type":"DT_FLOAT"},"Tpaddings":{"type":"DT_INT32"}}},
          {"name":"Conv2D_24","op":"Conv2D","input":["depthwise_22","Conv2D_24/filter"],"device":"/device:CPU:0","attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"dilations":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"VkFMSUQ="},"explicit_paddings":{"list":{}}}},
          {"name":"reshape","op":"Reshape","input":["classificator_8","reshape/shape"],"attr":{"T":{"type":"DT_FLOAT"},"Tshape":{"type":"DT_INT32"}}},
          {"name":"reshape_1","op":"Reshape","input":["regressor_8","reshape_1/shape"],"attr":{"T":{"type":"DT_FLOAT"},"Tshape":{"type":"DT_INT32"}}},
          {"name":"conv2d_23_1","op":"Add","input":["Conv2D_24","conv2d_23_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"add_22__xeno_compat__1","op":"Add","input":["channel_padding_3","conv2d_23_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"activation_23","op":"Relu","input":["add_22__xeno_compat__1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_23","op":"DepthwiseConv2dNative","input":["activation_23","depthwise_23/filter_in"],"attr":{"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"},"dilations":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}}}},
          {"name":"Conv2D_25","op":"Conv2D","input":["depthwise_23","Conv2D_25/filter"],"device":"/device:CPU:0","attr":{"use_cudnn_on_gpu":{"b":true},"T":{"type":"DT_FLOAT"},"dilations":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"padding":{"s":"VkFMSUQ="},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}}}},
          {"name":"conv2d_24_1","op":"Add","input":["Conv2D_25","conv2d_24_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"add_23__xeno_compat__1","op":"Add","input":["activation_23","conv2d_24_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"activation_24","op":"Relu","input":["add_23__xeno_compat__1"],"attr":{"T":{"type":"DT_FLOAT"}}},
